CREATE DATABASE IF NOT EXISTS hstdd DEFAULT CHARSET utf8 COLLATE utf8_general_ci;
use hstdd;

-- -----------------------------------------
-- Table structure for t_user
-- -----------------------------------------
DROP TABLE IF EXISTS t_user;
CREATE TABLE t_user
(
	userId INT(10) AUTO_INCREMENT PRIMARY KEY,
	userName VARCHAR(30),
	userTypeId INT(10),
	isMarried TINYINT(1),
	birthday TIMESTAMP
);

-- -----------------------------------------
-- Records of t_user
-- -----------------------------------------
INSERT INTO t_user VALUES ('1','Heller','1','0','2016-04-27 16:02:38');
INSERT INTO t_user VALUES ('2','Wang','1','1','2016-04-28 16:02:38');
INSERT INTO t_user VALUES ('3','Ruihua','2','0','2016-04-29 16:02:38');
INSERT INTO t_user VALUES ('4','宋贺','2','0','2016-04-30 16:02:38');
INSERT INTO t_user VALUES ('5','瑞华','3','0','2016-05-01 16:02:38');
INSERT INTO t_user VALUES ('6','宋賀','3','0','2016-05-02 16:02:38');
INSERT INTO t_user VALUES ('7','newName','2','1','2016-05-03 16:02:38');
INSERT INTO t_user VALUES ('8','TestInsert','2','1','2016-05-04 16:02:38');
INSERT INTO t_user VALUES ('9','He1','2','0','2016-05-05 16:02:38');




-- -----------------------------------------
-- Table structure for t_userType
-- -----------------------------------------
DROP TABLE IF EXISTS t_userType;
CREATE TABLE t_userType
(
	userTypeId INT(10) AUTO_INCREMENT PRIMARY KEY,
	userTypeName VARCHAR(30)
);

-- -----------------------------------------
-- Records of t_userType
-- -----------------------------------------
INSERT INTO t_userType VALUES ('1','Junior');
INSERT INTO t_userType VALUES ('2','Middle');
INSERT INTO t_userType VALUES ('3','Senior');




-- -----------------------------------------
-- Table structure for t_heroInfp
-- -----------------------------------------
DROP TABLE IF EXISTS t_heroInfp;
CREATE TABLE t_heroInfp
(
	id INT(10) AUTO_INCREMENT PRIMARY KEY,
	name VARCHAR(30),
	hp INT(4),
	mp INT(4),
	attack VARCHAR(10),
	defence VARCHAR(10),
	distance VARCHAR(10),
	speed VARCHAR(10),
	strength VARCHAR(25),
	swifiness VARCHAR(25),
	intelligence VARCHAR(25)
);

-- -----------------------------------------
-- Records of t_heroInfp
-- -----------------------------------------
INSERT INTO t_heroInfp VALUES ('1','矮人火枪手','454','195','36 - 42','2','550','290','16（+1.7）','21（+2.9）','15（+2.6）');
INSERT INTO t_heroInfp VALUES ('2','矮人直升机','492','299','41 - 51','2','375','305','18(+1.8)','24(+2.4)','23(+2.1)');
INSERT INTO t_heroInfp VALUES ('3','暗夜魔王','587','208','47 - 61','5.6','100','295','23(+2.8)','18(+2.25)','16(+1.25)');
INSERT INTO t_heroInfp VALUES ('4','暗影恶魔','473','338','53 -57','3','500','295','17（+1.9)','18（+2.2）','26（+2.7）');
INSERT INTO t_heroInfp VALUES ('5','暗影牧师','454','351','41 - 59','2','500','305','16（+1.85）','21（+1.7）','27（+3.4）');
INSERT INTO t_heroInfp VALUES ('6','暗影萨满','454','273','42 - 49','1.3','500','285','19（+1.6）','16（+1.6）','21（+3.0）');
INSERT INTO t_heroInfp VALUES ('7','奥林匹斯之王','511','260','41 - 49','2.1','350','295','19（+1.8）','11（+1.2）','20（+2.7）');
INSERT INTO t_heroInfp VALUES ('8','半人马酋长','587','195','55 - 57','3.1','100','300','23（+2.6）','15（+2.0）','15（+1.6）');
INSERT INTO t_heroInfp VALUES ('9','半人猛犸','549','221','49 - 61','4','128','315','21（+2.75）','15(+1.8)','17（+1.65）');
INSERT INTO t_heroInfp VALUES ('10','蝙蝠骑士','587','312','48 - 52','3','375','290','23（+2.5）','15（+1.5）','24(+2.5)');
INSERT INTO t_heroInfp VALUES ('11','变体精灵','511','221','49 - 58','2.7','350','285','19（+2.0）','15（+3.0）','17（+1.5）');
INSERT INTO t_heroInfp VALUES ('12','不朽尸王','625','351','57 - 65','3.4','100','310','22（+2.1）','10（+0.8）','27（+2.0）');
INSERT INTO t_heroInfp VALUES ('13','潮汐猎人','568','208','47 - 53','3.1','100','310','22（+3.0）','15（+1.5）','16（+1.7）');
INSERT INTO t_heroInfp VALUES ('14','沉默术士','473','273','43 - 57','1.3','600','290','17（+1.7）','16（+2.1）','21（+2.5）');
INSERT INTO t_heroInfp VALUES ('15','德鲁伊','473','169','46 - 50','2.4','550','305','17（+2.1）','24（+2.7）','13（1.4）');
INSERT INTO t_heroInfp VALUES ('16','敌法师','454','195','46 - 50','3.1','100','320','20（+1.2）','22（+2.8）','15（+1.5）');
INSERT INTO t_heroInfp VALUES ('17','地卜师','587','260','34 - 40','5.3','100','305','23（+1.3）','23（+1.9）','20（+1.6）');
INSERT INTO t_heroInfp VALUES ('18','地精修补匠','472','351','49 - 55','3.9','500','305','17（+2.0）','13（+1.2）','27（+2.2）');
INSERT INTO t_heroInfp VALUES ('19','地穴编织者','435','195','41 - 51','7','425','290','15（+1.5）','14（+2.5）','15（+1.8）');
INSERT INTO t_heroInfp VALUES ('20','地穴刺客','492','234','49 - 53','3.7','128','300','18（+2.0）','19（+2.2）','18（+2.1）');
INSERT INTO t_heroInfp VALUES ('21','地狱领主','587','273','55 - 65','4.4','100','300','23（+2.7）','17（+1.5）','21（+2.0）');
INSERT INTO t_heroInfp VALUES ('22','恶魔巫师','454','286','42 - 48','1','600','290','16（+1.7）','15（+1.5）','22（+3.0）');
INSERT INTO t_heroInfp VALUES ('23','发条地精','606','221','55 - 57','4','125','310','24（+2.9）','13（+1.2）','17（+1.7）');
INSERT INTO t_heroInfp VALUES ('24','风暴之灵','473','299','45 - 55','5.1','480','295','17（+1.5）','22（+1.8）','26（+2.6）');
INSERT INTO t_heroInfp VALUES ('25','风行者','435','286','45 - 56','1','600','295','15(+2.5)','17（+1.4）','22（+2.6）');
INSERT INTO t_heroInfp VALUES ('26','斧王','625','182','43 - 47','1.8','125','290','25（+2.5）','20（+2.2）','14（+1.6）');
INSERT INTO t_heroInfp VALUES ('27','复仇之魂','454','195','34 - 48','3.1','400','295','16（+2.3）','27（+2.35）','15（+1.75）');
INSERT INTO t_heroInfp VALUES ('28','蝮蛇','473','195','44 - 46','2','575','285','17（+1.9）','21（+2.5）','15（+1.8）');
INSERT INTO t_heroInfp VALUES ('29','钢背兽','568','182','52 - 62','4.4','100','295','22（+2.2）','17（+1.8）','14（+2.8）');
INSERT INTO t_heroInfp VALUES ('30','哥布林工程师','473','286','24 - 26','1','650','270','17（+2.0）','14（+1.3）','22（+2.9）');
INSERT INTO t_heroInfp VALUES ('31','光之守卫','454','286','38 - 54','1.1','600','315','16（+1.8）','15（1.6）','22（+2.8）');
INSERT INTO t_heroInfp VALUES ('32','海军上将','606','234','50 - 60','3','128','300','21（+2.7）','14（+1.3）','16（1.5）');
INSERT INTO t_heroInfp VALUES ('33','撼地神牛','568','208','46 - 56','2.7','128','300','22（+2.5）','12（+1.4）','16（+1.8）');
INSERT INTO t_heroInfp VALUES ('34','黑暗贤者','568','377','60 - 66','5.7','125','305','22（+2.3）','12（+1.2）','29（+3.1）');
INSERT INTO t_heroInfp VALUES ('35','黑暗游侠','473','195','40 - 51','2.2','625','300','17（+1.9）','22（+1.9）','15（+1.4）');
INSERT INTO t_heroInfp VALUES ('36','黑曜毁灭者','511','338','49 - 64','4.1','450','300','19（+1.85）','24（+2.0）','26（+2.8）');
INSERT INTO t_heroInfp VALUES ('37','幻影长矛手','492','273','45 - 67','3.3','128','290','18(+2.0)','23（+2.8）','21（+2.0）');
INSERT INTO t_heroInfp VALUES ('38','幻影刺客','473','169','46 - 48','4.2','128','310','17（+2.05）','23（+3.15）','13（+1.0）');
INSERT INTO t_heroInfp VALUES ('39','混沌骑士','530','208','49 - 70','4','128','325','20（+2.9）','14（+2.1）','16（+1.2）');
INSERT INTO t_heroInfp VALUES ('40','火凤凰','568','234','54 - 56','0','500','290','22（+2.9）','12（+1.3）','18（+1.8）');
INSERT INTO t_heroInfp VALUES ('41','极寒幽魂','492','325','43 - 54','4','600','295','18（+1.4）','20（+2.2）','25（+2.6）');
INSERT INTO t_heroInfp VALUES ('42','剑圣','530','182','44 - 48','3.8','100','305','20（+1.9）','20（+2.85）','14（+1.4）');
INSERT INTO t_heroInfp VALUES ('43','精灵守卫','473','299','33 - 42','0','525','295','21（+1.0）','17（+1.9）','23（+1.7）');
INSERT INTO t_heroInfp VALUES ('44','巨魔战将','473','169','38 - 56','2','500','300','17（+2.2）','21（+2.75）','13（+1.0）');
INSERT INTO t_heroInfp VALUES ('45','巨牙海民','587','234','50 - 54','3.2','128','305','23（+2.3）','23（+2.1）','18（+1.7）');
INSERT INTO t_heroInfp VALUES ('46','剧毒术士','492','195','46 - 48','3','450','290','18（+1.85）','22（+2.6）','15（+1.75）');
INSERT INTO t_heroInfp VALUES ('47','骷髅射手','435','208','37 - 43','2.1','600','300','15（+1.6）','22（+3.0）','16（+1.55）');
INSERT INTO t_heroInfp VALUES ('48','骷髅王','568','169','54 - 56','3.6','128','300','22（+2.9）','18（+1.7）','13（+1.6）');
INSERT INTO t_heroInfp VALUES ('49','狼人','568','195','53 - 57','3.3','100','305','22（+2.75）','16（+1.9）','15（+1.55）');
INSERT INTO t_heroInfp VALUES ('50','炼金术士','625','325','49 - 58','0.6','128','300','25（+1.8）','11（+1.2）','25（+1.8）');
INSERT INTO t_heroInfp VALUES ('51','裂魂人','587','195','45 - 55','5.4','128','295','23（+2.5）','17（1.7）','15（+1.8）');
INSERT INTO t_heroInfp VALUES ('52','灵魂守卫','435','195','48 - 64','5.1','128','300','15（+1.9）','22（+3.2）','15（+1.75）');
INSERT INTO t_heroInfp VALUES ('53','流浪剑客','587','182','54 - 56','2','128','295','23（+2.7）','21（+2.0）','14（+1.3）');
INSERT INTO t_heroInfp VALUES ('54','龙骑士','511','195','46 - 52','4.4','128','290','19（+2.8)','19(+2.2)','15(+1.7)');
INSERT INTO t_heroInfp VALUES ('55','魅惑魔女','454','208','47 - 57','1.7','550','305','16（+1.0）','19（+1.8）','16（+2.8）');
INSERT INTO t_heroInfp VALUES ('56','谜团','473','260','42 - 48','1','500','300','17（+2.1）','14（+1.0）','20（+3.4）');
INSERT INTO t_heroInfp VALUES ('57','末日使者','644','208','53 - 69','3.6','150','300','26（+3.2）','11（+0.9）','13（+2.1）');
INSERT INTO t_heroInfp VALUES ('58','娜迦海妖','549','234','51 - 53','5.9','128','320','21（+2.3）','21（+2.75）','18（+1.65）');
INSERT INTO t_heroInfp VALUES ('59','牛头人酋长','606','299','57 - 67','3','150','310','21（+2.7）','14（+1.5）','23（+1.6）');
INSERT INTO t_heroInfp VALUES ('60','全能骑士','530','221','51 - 61','4.1','100','300','20（+2.65）','15（+1.75）','17（+1.8）');
INSERT INTO t_heroInfp VALUES ('61','沙王','492','208','43 - 59','1','128','300','18(+2.3)','19(+2.1)','16(+1.8)');
INSERT INTO t_heroInfp VALUES ('62','山岭巨人','606','182','61 - 67','0.3','128','285','24（+3.0）','9（+0.9）','14（+1.4）');
INSERT INTO t_heroInfp VALUES ('63','闪电幽魂','473','182','45 - 47','2.1','475','295','21（+1.7）','22（+2.0）','19（+2.2）');
INSERT INTO t_heroInfp VALUES ('64','赏金猎人','473','208','45 - 59','4','128','315','17（+1.8）','21（+3.0）','16（+1.4）');
INSERT INTO t_heroInfp VALUES ('65','蛇发女妖','473','247','44 - 50','1.9','600','290','14（+1.65）','20（+2.5）','19（+1.85）');
INSERT INTO t_heroInfp VALUES ('66','深渊领主','625','221','62 - 68','4.7','128','305','25（+2.6）','12（+1.3）','17（+2.6）');
INSERT INTO t_heroInfp VALUES ('67','神灵武士','492','234','39 - 48','2','400','300','18（+2.4）','20（+2.4）','18（+1.5）');
INSERT INTO t_heroInfp VALUES ('68','圣骑士','530','273','43 - 53','1.1','600','300','20（+1.5）','15（+2.1）','21（+2.8）');
INSERT INTO t_heroInfp VALUES ('69','圣堂刺客','492','260','45 - 55','4.2','140','305','18（+2.1）','23（+2.7）','20（+2.0）');
INSERT INTO t_heroInfp VALUES ('70','食人魔魔法师','587','221','58 - 64','5','128','295','23（+3.2）','14（+1.55）','17（+2.4）');
INSERT INTO t_heroInfp VALUES ('71','食尸鬼','625','195','52 - 67','2','100','315','25（+2.4）','18（+1.9）','15（+1.75）');
INSERT INTO t_heroInfp VALUES ('72','受折磨的灵魂','454','338','45 - 49','1','600','310','16（+1.5）','23（+1.7）','26（+3.0）');
INSERT INTO t_heroInfp VALUES ('73','兽王','587','208','56 - 60','4.6','128','310','23（+2.2）','18（+1.6）','16（+1.9）');
INSERT INTO t_heroInfp VALUES ('74','术士','492','312','46 - 56','2.4','600','295','18（+2.5）','10（+1.0）','24（+2.7）');
INSERT INTO t_heroInfp VALUES ('75','树精守卫','663','221','59 - 67','2.4','128','300','27（+3.4）','10（+2.0）','17（+1.8）');
INSERT INTO t_heroInfp VALUES ('76','双头龙','606','364','42 - 54','2.4','400','290','24（+2.3）','10（+1.2）','28（+2.8）');
INSERT INTO t_heroInfp VALUES ('77','水晶室女','454','273','38 - 44','1.3','600','280','16（+1.7）','16（+1.6）','21（+2.9）');
INSERT INTO t_heroInfp VALUES ('78','死灵法师','454','286','44 - 48','1.1','600','290','16（+2.0）','15（+1.7）','22（+2.5）');
INSERT INTO t_heroInfp VALUES ('79','死灵飞龙','473','247','33 - 43','1.4','600','295','20（+2.2）','11（+1.3）','21（+2.5）');
INSERT INTO t_heroInfp VALUES ('80','死亡先知','473','260','39 - 51','1','600','285','19（+1.8）','14（+1.4）','20（+3.0）');
INSERT INTO t_heroInfp VALUES ('81','痛苦女王','454','247','40 - 48','1.6','550','300','16（+1.7）','18（+2.0）','24（+2.5）');
INSERT INTO t_heroInfp VALUES ('82','痛苦之源','492','234','51 - 57','3.6','400','305','18（+2.1）','18（+2.1）','18（+2.1）');
INSERT INTO t_heroInfp VALUES ('83','屠夫','625','182','52 - 58','2','128','285','25（+3.2）','14（+1.5）','14（+1.5）');
INSERT INTO t_heroInfp VALUES ('84','巫妖','492','234','42 - 51','1','550','315','18（+1.55）','15（+2.0）','18（+3.25）');
INSERT INTO t_heroInfp VALUES ('85','巫医','454','312','51 - 61','1','600','305','16（+1.8）','13（+1.4）','24（+2.9）');
INSERT INTO t_heroInfp VALUES ('86','仙女龙','435','325','40 - 51','2.1','550','295','15（+1.7）','22（+1.7）','25（+2.4）');
INSERT INTO t_heroInfp VALUES ('87','先知','473','273','39 - 53','3.1','600','300','17（+1.8）','18（+1.9）','21（+2.9）');
INSERT INTO t_heroInfp VALUES ('88','熊猫酒仙','587','182','52 - 59','3.3','128','300','23（+2.9）','16（+1.95）','14（+1.25）');
INSERT INTO t_heroInfp VALUES ('89','熊战士','587','208','45 - 49','4.6','128','310','23（+2.9）','18（+2.1）','16（+1.5）');
INSERT INTO t_heroInfp VALUES ('90','秀逗魔导师','492','247','32 - 50','1.2','600','295','18（+1.5）','16（+1.5）','24（+3.2）');
INSERT INTO t_heroInfp VALUES ('91','虚空假面','473','195','58 - 64','4','128','300','17（+1.4）','21（+2.65）','15（+1.5）');
INSERT INTO t_heroInfp VALUES ('92','血魔','587','234','53 - 59','3.4','128','305','23（+2.0）','24（+3.0）','18（+1.7）');
INSERT INTO t_heroInfp VALUES ('93','遗忘法师','473','338','45 - 53','1.3','600','315','17（+1.45）','16（+1.0）','26（+4.0）');
INSERT INTO t_heroInfp VALUES ('94','隐形刺客','473','182','48 - 52','6.4','125','300','17（+2.0）','24（+2.9）','14（+1.3)');
INSERT INTO t_heroInfp VALUES ('95','影魔','435','234','35 - 41','1.9','500','300','15（+2.0）','20（+2.4）','18（+2.0）');
INSERT INTO t_heroInfp VALUES ('96','幽鬼','511','208','46 - 50','3.3','128','295','19（+2.0）','23（+2.2）','16（+1.9）');
INSERT INTO t_heroInfp VALUES ('97','鱼人守卫','549','195','51 - 59','4.4','128','300','21（+2.8）','17（+1.9）','15（+1.5）');
INSERT INTO t_heroInfp VALUES ('98','鱼人夜行者','549','208','48 - 56','2','128','305','21（+1.0）','21（+2.0）','16（+1.6）');
INSERT INTO t_heroInfp VALUES ('99','育母蜘蛛','473','234','44 - 50','2.6','128','315','17（+2.5）','18（+2.2）','18（+2.0）');
INSERT INTO t_heroInfp VALUES ('100','预言者','511','286','49 - 53','1','600','300','19（+1.9）','15（+1.4）','22（+2.5）');
INSERT INTO t_heroInfp VALUES ('101','月之女祭司','473','221','38 - 49','1.9','600','300','17（+1.85）','20（+2.75）','17（+1.65）');
INSERT INTO t_heroInfp VALUES ('102','月之骑士','435','208','43 - 49','3.1','330','320','15（+1.75)','22(+2.8)','16（+1.85)');
INSERT INTO t_heroInfp VALUES ('103','召唤师','511','286','44 - 50','1.8','600','280','19（+1.4）','20（+1.9)','22（+2.5）');




-- -----------------------------------------
-- Table structure for t_question
-- -----------------------------------------
DROP TABLE IF EXISTS t_question;
CREATE TABLE t_question
(
	questionId INT(10) AUTO_INCREMENT PRIMARY KEY,
	content VARCHAR(80),
	userName VARCHAR(10),
	parentId INT(10)
);

-- -----------------------------------------
-- Records of t_question
-- -----------------------------------------
INSERT INTO t_question VALUES ('1','怎样举报？','张某某','0');
INSERT INTO t_question VALUES ('2','点击开始，填报内容','祝某某','1');
INSERT INTO t_question VALUES ('3','手动举报啊','王某某','1');
INSERT INTO t_question VALUES ('4','图片怎么上传啊？','张某某','0');
INSERT INTO t_question VALUES ('5','upload','祝某某','4');
INSERT INTO t_question VALUES ('6','不知道呀','王某某','4');
INSERT INTO t_question VALUES ('7','你自己试试啊','张某某','4');




-- -----------------------------------------
-- Table structure for t_airQuality
-- -----------------------------------------
DROP TABLE IF EXISTS t_airQuality;
CREATE TABLE t_airQuality
(
	airId INT(10) AUTO_INCREMENT PRIMARY KEY,
	userGroupId INT(10),
	o2 VARCHAR(10),
	co2 VARCHAR(10),
	light VARCHAR(10),
	temperature VARCHAR(10),
	humility VARCHAR(10),
	grain VARCHAR(10),
	so2 VARCHAR(10),
	formaldehyde VARCHAR(10)
);

-- -----------------------------------------
-- Records of t_airQuality
-- -----------------------------------------
INSERT INTO t_airQuality VALUES ('1','1','0.98','0.99','556','38','200','466','0.88','0.56');
INSERT INTO t_airQuality VALUES ('2','1','0.99','0.99','555','34','300','500','0.98','0.45');
INSERT INTO t_airQuality VALUES ('3','2','0.98','0.99','556','38','200','466','0.88','0.56');
INSERT INTO t_airQuality VALUES ('4','1','0.99','0.99','555','34','300','500','0.98','0.45');
